#+title: Queueing theory assignment: Controlled queues
#+author: Nicky D. van Foreest
#+date: 2022:01:19

#+STARTUP: indent
#+STARTUP: overview
#+PROPERTY: header-args:shell :exports both
#+PROPERTY: header-args:emacs-lisp :eval no-export
#+PROPERTY: header-args:python :eval no-export
# +PROPERTY: header-args:python :session  :exports both   :dir "./figures/" :results output

#+include: preamble.org


** Again start without blocking

We need a slightly different way to generate service times. When a batch of $B_k$ jobs arrives at time $A_{k}$, then the service time added to the waiting is the sum of the service times of all $B_{k}$ jobs in the batch.


#+begin_src python
import numpy as np
from scipy.stats import expon

np.random.seed(3)

num = 100000
labda = 1
mu = 1.1 * labda
X = np.random.exponential(scale=1 / labda, size=num)
B = np.random.randint(1, 2, size=num)
S = expon(scale=1 / mu)

W = np.zeros_like(X)
for k in range(1, len(W)):
    W[k] = max(W[k - 1] + S.rvs(B[k]).sum() - X[k], 0)

print(S.mean(), W.mean(), W.max())
rho = labda / mu
print(rho**2 / (1 - rho))
#+end_src

#+RESULTS:
: 0.9090909090909091 8.905084979504103 69.31370721304536
: 9.090909090909086

#+begin_exercise
Explain how this code works.
#+end_exercise

#+begin_exercise
Run the code. Why do I take ~B~ as it is here? Why should ~W.mean()~ and $\rho^2/(1-\rho)$ be approximately equal
#+begin_hint
Why is this the $M/M/1$ queue when the batches  ~B = np.random.randint(1, 2, size=num)~? (Recall my obsession with testing code.)
#+end_hint
#+end_exercise

** Start without blocking

As before, I start from a code that I really understand, and then I extend it to a situation that I find more difficult.  So, here is code to find the system length $L$ at /arrival/ epochs $\{A_k\}$.

#+begin_src python
import numpy as np

np.random.seed(3)

num = 10000
labda = 1
mu = 1.5 * labda
X = np.random.exponential(scale=1 / labda, size=num)
A = np.zeros(len(X) + 1)
A[1:] = X.cumsum()
S = np.random.exponential(scale=1 / mu, size=len(A))
S[0] = 0
D = np.zeros_like(A)
L = np.zeros_like(A, dtype=int)

idx = 0
for k in range(1, len(A)):
    D[k] = max(D[k - 1], A[k]) + S[k]
    while D[idx] < A[k]:
        idx += 1
    L[k] = k - idx

rho = labda / mu
print(L.mean(), rho/(1-rho), L.max())
print((L == 0).mean(), 1 - rho)
print((L == 1).mean(), (1 - rho)*rho)
#+end_src

#+RESULTS:
: 1.9834016598340165 1.9999999999999998 19
: 0.32216778322167783 0.33333333333333337
: 0.22507749225077492 0.22222222222222224

#+begin_exercise
Explain how this computes ~L[k]~. Do we count the system length as seen upon arrival, or does ~L[k]~ include  job $k$, i.e., the job that just arrived?
#+begin_hint
When the while loop terminates, is ~idx~ the index of the last departure, or does it point to the job that is the first to leave?
#+end_hint
#+end_exercise

#+begin_exercise
Just to check that you  really understand: why is there no problem with the statement ~(L == 0)~?
#+begin_hint
Is ~L~ a float?
#+end_hint
#+end_exercise

#+begin_exercise
Why do I compare ~L.mean()~ to $\rho/(1-\rho)$ and not to $\rho^{2}/1-\rho)$?
#+begin_hint
What is $\rho^2/(1-\rho)$?
#+end_hint
#+end_exercise

#+begin_exercise
Change $\mu$ to $1.05\lambda$. Now the results of the simulation are not very good if ~num=1000~ or so. Making ~num~ much larger does the job, though.
#+end_exercise


